export const WRONG_INPUT_ERROR =
  "입력이 잘못되었습니다.\n쉼표(,) 또는 콜론(:)을 구분자로 가지는 문자열을 전달하는 경우 구분자를 기준으로 분리한 각 숫자의 합을 반환합니다.\n- 입력 예시) 1:2,3\n구분자로 사용할 문자를 //와 \\n 사이에 적어 문자열 앞부분에 넣어 커스텀 구분자를 추가할 수 있습니다.\n- 입력 예시) //;\\n1;2;3 -> 세미콜론(;)이 구분자로 추가됩니다.";
export const WRONG_SELECTOR_ERROR =
  "커스텀 구분자를 잘못 지정하셨습니다.\n문자열 앞부분에 커스텀 구분자를 //와 \\n 사이에 적어 넣어보세요!\n- 입력 예시) //;\\n1;2;3 -> 세미콜론(;)이 구분자로 추가됩니다.";
export const WRONG_SEPERATOR_ERROR =
  "지정되지 않은 구분자를 사용하셨습니다. 혹시 커스텀 구분자 기능을 사용해보시겠어요?\n구분자로 사용할 문자를 //와 \\n 사이에 적어 문자열 앞부분에 넣어보세요!\n- 입력 예시) //;\\n1;2;3 -> 세미콜론(;)이 구분자로 추가됩니다.";
export const WRONG_NUMBERS_ERROR =
  "숫자 배열을 잘못 입력하셨습니다.\n숫자배열은 숫자 사이에 구분자를 가지는 문자열입니다. 기본 구분자는 쉼표(,) 또는 콜론(:)입니다.\n- 입력 예시) 1:2,3";
